import and load dataset

In [1]:
import pandas as pd
import numpy as np
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank", "Grace", "Hannah"],
    "Age": [24, 30, 22, 35, 29, 40, 28, 31],
    "Salary": [50000, 60000, 55000, 70000, 65000, 80000, 72000, 58000],
    "Department": ["HR", "Finance", "IT", "Marketing", "Finance", "IT", "HR", "Marketing"],
    "Rating": [4.5, 3.8, 4.0, 4.2, 3.9, 4.8, 4.1, 3.7]
}
df = pd.DataFrame(data)

DataFrame modifiation

In [ ]:
# insert a new column

#Straightforward way to insert a new column
df['Experience_Years'] = [2, 5, 1, 8, 4, 10, 3, 6] #This will add a new column at the end of the DataFrame
print(df.head(3))

print("\n")

# Using the insert method to add a new column at a specific position
df.insert(2, 'Location', ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio', 'San Diego'])
print(df.head(3))

      Name  Age     Location  Salary Department  Rating  Experience_Years
0    Alice   24     New York   50000         HR     4.5                 2
1      Bob   30  Los Angeles   60000    Finance     3.8                 5
2  Charlie   22      Chicago   55000         IT     4.0                 1


      Name  Age     Location  Salary Department  Rating  Experience_Years
0    Alice   24     New York   50000         HR     4.5                 2
1      Bob   30  Los Angeles   60000    Finance     3.8                 5
2  Charlie   22      Chicago   55000         IT     4.0                 1

In [8]:
# updating a single value in the DataFrame
df.at[0, 'Salary'] = 52000  # Update Alice's salary
df.loc[1, 'Rating'] = 4.1  # Update Bob's rating
print(df.head(3))

      Name  Age     Location  Salary Department  Rating  Experience_Years
0    Alice   24     New York   52000         HR     4.5                 2
1      Bob   30  Los Angeles   60000    Finance     4.1                 5
2  Charlie   22      Chicago   55000         IT     4.0                 1

In [9]:
# updating a column
df['Salary'] = df['Salary'] * 1.1  # Increase all salaries by 10%
print(df.head(5))

      Name  Age     Location   Salary Department  Rating  Experience_Years
0    Alice   24     New York  57200.0         HR     4.5                 2
1      Bob   30  Los Angeles  66000.0    Finance     4.1                 5
2  Charlie   22      Chicago  60500.0         IT     4.0                 1
3    David   35      Houston  77000.0  Marketing     4.2                 8
4      Eve   29      Phoenix  71500.0    Finance     3.9                 4

In [10]:
# drop columns
df.drop(columns=['Experience_Years', 'Location'], inplace=True)  # Drop the columns we just added
# here inplace=True means that the changes will be applied to the original DataFrame
print(df.head(3))

      Name  Age   Salary Department  Rating
0    Alice   24  57200.0         HR     4.5
1      Bob   30  66000.0    Finance     4.1
2  Charlie   22  60500.0         IT     4.0

Inspect Missing Data

In [5]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', np.nan],
    'Age': [25, np.nan, 30, 45, np.nan, 29, 33],
    'Gender': ['F', 'M', np.nan, 'M', 'F', 'M', 'F'],
    'Department': ['HR', 'IT', 'Finance', np.nan, 'HR', 'Finance', 'IT'],
    'Salary': [50000, 60000, 70000, 80000, np.nan, 65000, 72000]
}

df = pd.DataFrame(data)
print(df)

      Name   Age Gender Department   Salary
0    Alice  25.0      F         HR  50000.0
1      Bob   NaN      M         IT  60000.0
2  Charlie  30.0    NaN    Finance  70000.0
3    David  45.0      M        NaN  80000.0
4      Eva   NaN      F         HR      NaN
5    Frank  29.0      M    Finance  65000.0
6      NaN  33.0      F         IT  72000.0

In [7]:
# Check which values are missing
print(df.isnull())

    Name    Age  Gender  Department  Salary
0  False  False   False       False   False
1  False   True   False       False   False
2  False  False    True       False   False
3  False  False   False        True   False
4  False   True   False       False    True
5  False  False   False       False   False
6   True  False   False       False   False

In [8]:
# Count total missing values per column
print(df.isnull().sum())

Name          1
Age           2
Gender        1
Department    1
Salary        1
dtype: int64

In [11]:
# summary of the dataset
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Gender      6 non-null      object
 3   Department  6 non-null      object
 4   Salary      6 non-null      float64
dtypes: float64(2), object(3)
memory usage: 412.0+ bytes
None

In [12]:
#  Find rows that contain any missing values
print(df[df.isnull().any(axis=1)])

      Name   Age Gender Department   Salary
1      Bob   NaN      M         IT  60000.0
2  Charlie  30.0    NaN    Finance  70000.0
3    David  45.0      M        NaN  80000.0
4      Eva   NaN      F         HR      NaN
6      NaN  33.0      F         IT  72000.0

In [14]:
# Find rows that are fully missing (none in this case)
print(df[df.isnull().all(axis=1)])

Empty DataFrame
Columns: [Name, Age, Gender, Department, Salary]
Index: []

Handling missing values with different methods

In [28]:
# Dataset with missing values
import pandas as pd
import numpy as np
data = {
    'EmployeeID': [101, 102, 103, 104, 105, 106, 107, 108],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', np.nan, 'George', 'Helen'],
    'Age': [25, np.nan, 30, 45, np.nan, 28, 40, 38],
    'Department': ['HR', 'IT', 'Finance', np.nan, 'HR', 'Finance', 'IT', 'IT'],
    'JoiningDate': ['2020-01-15', '2019-11-01', np.nan, '2018-05-20', '2021-02-10', '2020-08-01', np.nan, '2022-03-15'],
    'Salary': [50000, 60000, 70000, 80000, np.nan, 64000, np.nan, 72000],
    'PerformanceRating': [3.5, 4.0, np.nan, 4.5, 3.8, 4.2, np.nan, 3.9]
}

df = pd.DataFrame(data)
df['JoiningDate'] = pd.to_datetime(df['JoiningDate'])  # Convert to datetime
df

,EmployeeID,Name,Age,Department,JoiningDate,Salary,PerformanceRating
0,101,Alice,25.0,HR,2020-01-15,50000.0,3.5
1,102,Bob,NaN,IT,2019-11-01,60000.0,4.0
2,103,Charlie,30.0,Finance,NaT,70000.0,NaN
3,104,David,45.0,NaN,2018-05-20,80000.0,4.5
4,105,Eva,NaN,HR,2021-02-10,NaN,3.8
5,106,NaN,28.0,Finance,2020-08-01,64000.0,4.2
6,107,George,40.0,IT,NaT,NaN,NaN
7,108,Helen,38.0,IT,2022-03-15,72000.0,3.9

In [29]:
# Drop rows with any missing values
df_droped_rows = df.dropna()
print(df_droped_rows)

print("\n")

# Drop columns with any missing value:
df_droped_cols = df.dropna(axis=1)
print(df_droped_cols)

print("\n")

# Drop rows only if all values are missing
df_droped_all = df.dropna(how='all')
print(df_droped_all)

   EmployeeID   Name   Age Department JoiningDate   Salary  PerformanceRating
0         101  Alice  25.0         HR  2020-01-15  50000.0                3.5
7         108  Helen  38.0         IT  2022-03-15  72000.0                3.9


   EmployeeID
0         101
1         102
2         103
3         104
4         105
5         106
6         107
7         108


   EmployeeID     Name   Age Department JoiningDate   Salary  \
0         101    Alice  25.0         HR  2020-01-15  50000.0
1         102      Bob   NaN         IT  2019-11-01  60000.0
2         103  Charlie  30.0    Finance         NaT  70000.0
3         104    David  45.0        NaN  2018-05-20  80000.0
4         105      Eva   NaN         HR  2021-02-10      NaN
5         106      NaN  28.0    Finance  2020-08-01  64000.0
6         107   George  40.0         IT         NaT      NaN
7         108    Helen  38.0         IT  2022-03-15  72000.0

   PerformanceRating
0                3.5
1                4.0
2                NaN
3                4.5
4                3.8
5                4.2
6                NaN
7                3.9

In [30]:
# Fill with a fixed value (e.g., 0, "Unknown"):
df_filled_fixed = df.fillna({'Age': 0, 'Department': 'Unknown', 'Salary': 0})
print(df_filled_fixed)

   EmployeeID     Name   Age Department JoiningDate   Salary  \
0         101    Alice  25.0         HR  2020-01-15  50000.0
1         102      Bob   0.0         IT  2019-11-01  60000.0
2         103  Charlie  30.0    Finance         NaT  70000.0
3         104    David  45.0    Unknown  2018-05-20  80000.0
4         105      Eva   0.0         HR  2021-02-10      0.0
5         106      NaN  28.0    Finance  2020-08-01  64000.0
6         107   George  40.0         IT         NaT      0.0
7         108    Helen  38.0         IT  2022-03-15  72000.0

   PerformanceRating
0                3.5
1                4.0
2                NaN
3                4.5
4                3.8
5                4.2
6                NaN
7                3.9

In [32]:
# Fill with mean/median/mode (numeric):
df_filled_mean = df.fillna(df.mean(numeric_only=True))  # Fill numeric columns with mean
print(df_filled_mean)

print("\n")

df_filled_median = df.fillna(df.median(numeric_only=True))  # Fill numeric columns with median
print(df_filled_median)

   EmployeeID     Name        Age Department JoiningDate   Salary  \
0         101    Alice  25.000000         HR  2020-01-15  50000.0
1         102      Bob  34.333333         IT  2019-11-01  60000.0
2         103  Charlie  30.000000    Finance         NaT  70000.0
3         104    David  45.000000        NaN  2018-05-20  80000.0
4         105      Eva  34.333333         HR  2021-02-10  66000.0
5         106      NaN  28.000000    Finance  2020-08-01  64000.0
6         107   George  40.000000         IT         NaT  66000.0
7         108    Helen  38.000000         IT  2022-03-15  72000.0

   PerformanceRating
0           3.500000
1           4.000000
2           3.983333
3           4.500000
4           3.800000
5           4.200000
6           3.983333
7           3.900000


   EmployeeID     Name   Age Department JoiningDate   Salary  \
0         101    Alice  25.0         HR  2020-01-15  50000.0
1         102      Bob  34.0         IT  2019-11-01  60000.0
2         103  Charlie  30.0    Finance         NaT  70000.0
3         104    David  45.0        NaN  2018-05-20  80000.0
4         105      Eva  34.0         HR  2021-02-10  67000.0
5         106      NaN  28.0    Finance  2020-08-01  64000.0
6         107   George  40.0         IT         NaT  67000.0
7         108    Helen  38.0         IT  2022-03-15  72000.0

   PerformanceRating
0               3.50
1               4.00
2               3.95
3               4.50
4               3.80
5               4.20
6               3.95
7               3.90

In [35]:
# . Forward Fill / Backward Fill
df_filled_ffill = df.fillna(method='ffill')  # Forward fill
print(df_filled_ffill)
print("-" * 50)
df_filled_bfill = df.fillna(method='bfill')  # Backward fill
print(df_filled_bfill)

   EmployeeID     Name   Age Department JoiningDate   Salary  \
0         101    Alice  25.0         HR  2020-01-15  50000.0
1         102      Bob  25.0         IT  2019-11-01  60000.0
2         103  Charlie  30.0    Finance  2019-11-01  70000.0
3         104    David  45.0    Finance  2018-05-20  80000.0
4         105      Eva  45.0         HR  2021-02-10  80000.0
5         106      Eva  28.0    Finance  2020-08-01  64000.0
6         107   George  40.0         IT  2020-08-01  64000.0
7         108    Helen  38.0         IT  2022-03-15  72000.0

   PerformanceRating
0                3.5
1                4.0
2                4.0
3                4.5
4                3.8
5                4.2
6                4.2
7                3.9
--------------------------------------------------
   EmployeeID     Name   Age Department JoiningDate   Salary  \
0         101    Alice  25.0         HR  2020-01-15  50000.0
1         102      Bob  30.0         IT  2019-11-01  60000.0
2         103  Charlie  30.0    Finance  2018-05-20  70000.0
3         104    David  45.0         HR  2018-05-20  80000.0
4         105      Eva  28.0         HR  2021-02-10  64000.0
5         106   George  28.0    Finance  2020-08-01  64000.0
6         107   George  40.0         IT  2022-03-15  72000.0
7         108    Helen  38.0         IT  2022-03-15  72000.0

   PerformanceRating
0                3.5
1                4.0
2                4.5
3                4.5
4                3.8
5                4.2
6                3.9
7                3.9

C:\Users\eiami\AppData\Local\Temp\ipykernel_9620\1197319779.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_ffill = df.fillna(method='ffill')  # Forward fill
C:\Users\eiami\AppData\Local\Temp\ipykernel_9620\1197319779.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_bfill = df.fillna(method='bfill')  # Backward fill

In [36]:
# interpolate missing values
# Especially useful for time-series or continuous data
df_interpolated = df.interpolate(method='linear')  # Linear interpolation
print(df_interpolated)

   EmployeeID     Name   Age Department         JoiningDate   Salary  \
0         101    Alice  25.0         HR 2020-01-15 00:00:00  50000.0
1         102      Bob  27.5         IT 2019-11-01 00:00:00  60000.0
2         103  Charlie  30.0    Finance 2019-02-09 00:00:00  70000.0
3         104    David  45.0        NaN 2018-05-20 00:00:00  80000.0
4         105      Eva  36.5         HR 2021-02-10 00:00:00  72000.0
5         106      NaN  28.0    Finance 2020-08-01 00:00:00  64000.0
6         107   George  40.0         IT 2021-05-23 12:00:00  68000.0
7         108    Helen  38.0         IT 2022-03-15 00:00:00  72000.0

   PerformanceRating
0               3.50
1               4.00
2               4.25
3               4.50
4               3.80
5               4.20
6               4.05
7               3.90

C:\Users\eiami\AppData\Local\Temp\ipykernel_9620\1484454048.py:3: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df_interpolated = df.interpolate(method='linear')  # Linear interpolation